Repository: LuicdLabs/OneMMC
Catalog: src/OneMMC/Strings/*/AzMan.resw
Source language: en_us
Languages: zh_tw

# CreateStoreDialog_Title
source: New Authorization Store
zh_tw: 新增授權儲存體

# CreateStoreDialog_Subtitle
source: Create a new authorization store for Windows Authorization Manager.
zh_tw: 為 Windows Authorization Manager 建立新的授權儲存體。

# CreateStoreDialog_StoreType_Label
source: Store type
zh_tw: 儲存體類型

# CreateStoreDialog_StoreType_Xml
source: XML file
zh_tw: XML 檔案

# CreateStoreDialog_XmlPath_Label
source: File path
zh_tw: 檔案路徑

# CreateStoreDialog_Browse_Button
source: Browse
zh_tw: 瀏覽

# CreateStoreDialog_AdPath_Label
source: Active Directory path
zh_tw: Active Directory 路徑

# CreateStoreDialog_AdPath_Example
source: Example: CN=MyStore,CN=Program Data,DC=contoso,DC=com
zh_tw: 範例：CN=MyStore,CN=Program Data,DC=contoso,DC=com

# CreateStoreDialog_Sql_Label
source: SQL Server connection
zh_tw: SQL Server 連線

# CreateStoreDialog_Sql_Server_Placeholder
source: Server name or IP address
zh_tw: 伺服器名稱或 IP 位址

# CreateStoreDialog_Sql_Database_Placeholder
source: Database name
zh_tw: 資料庫名稱

# CreateStoreDialog_Sql_Store_Placeholder
source: Policy store name
zh_tw: Policy 儲存體名稱

# CreateStoreDialog_Sql_Format
source: Format: Server/Database/StoreName
zh_tw: 格式：Server/Database/StoreName

# CreateStoreDialog_Description_Label
source: Description (optional)
zh_tw: 描述（選填）

# CreateStoreDialog_Description_Placeholder
source: Enter a description for this store
zh_tw: 輸入此儲存體的描述

# CreateStoreDialog_GenerateAudits
source: Generate audits
zh_tw: 啟用稽核

# CreateStoreDialog_FileDialog_Title
source: Select Authorization Store Location
zh_tw: 選取授權儲存體位置

# CreateStoreDialog_Error_EmptyPath
source: Please specify a valid store path.
zh_tw: 請指定有效的儲存體路徑。

# CreateStoreDialog_Error_DirectoryMissing
source: The directory '{0}' does not exist.
zh_tw: 目錄 '{0}' 不存在。

# CreateStoreDialog_Error_FileExists
source: The file '{0}' already exists. Please choose a different name.
zh_tw: 檔案 '{0}' 已存在。請選擇不同的名稱。

# AuthorizationManagerPage_SearchPlaceholder
source: Search auth stores
zh_tw: 搜尋授權儲存體

# AuthorizationManagerPage_StoreCount_Default
source: No authorization stores
zh_tw: 沒有授權儲存體

# AuthorizationManagerPage_NewTooltip
source: New authorization store
zh_tw: 新增授權儲存體

# AuthorizationManagerPage_NewButton
source: New
zh_tw: 新增

# AuthorizationManagerPage_OpenTooltip
source: Open authorization store
zh_tw: 開啟授權儲存體

# AuthorizationManagerPage_RefreshAll
source: Refresh all
zh_tw: 全部重新整理

# AuthorizationManagerPage_Deprecation_Title
source: Notice
zh_tw: 提醒

# AuthorizationManagerPage_Deprecation_Message
source: Authorization Manager is being deprecated. Migrate to Entra RBAC.
zh_tw: 授權管理員即將淘汰，請遷移至 Entra RBAC。

# AuthorizationManagerPage_EmptyTitle
source: No authorization stores
zh_tw: 沒有授權儲存體

# AuthorizationManagerPage_EmptySubtitle
source: Create or open a store to get started.
zh_tw: 建立或開啟儲存體以開始使用。

# AuthorizationManagerPage_CloseStoreTooltip
source: Close store
zh_tw: 關閉儲存體

# AuthorizationManagerPage_Status_CreateSuccess
source: Authorization store created.
zh_tw: 授權儲存體已建立。

# AuthorizationManagerPage_Status_OpenSuccess
source: Authorization store opened.
zh_tw: 授權儲存體已開啟。

# AuthorizationManagerPage_Status_CloseStore
source: Authorization store closed.
zh_tw: 授權儲存體已關閉。

# AuthorizationManager_StoreCount_Singular
source: {0} authorization store
zh_tw: {0} 個授權儲存體

# AuthorizationManager_StoreCount_Plural
source: {0} authorization stores
zh_tw: {0} 個授權儲存體

# AuthorizationManager_Status_CreatingStore
source: Creating authorization store
zh_tw: 正在建立授權儲存體

# AuthorizationManager_Status_OpeningStore
source: Opening authorization store
zh_tw: 正在開啟授權儲存體

# AuthorizationManager_Status_DeletingStore
source: Deleting authorization store
zh_tw: 正在刪除授權儲存體

# AuthorizationManager_Status_Refreshing
source: Refreshing
zh_tw: 重新整理中

# AuthorizationManager_Status_RefreshingAll
source: Refreshing all stores
zh_tw: 正在重新整理所有儲存體

# AuthorizationManager_Status_CreateSuccess
source: Authorization store created.
zh_tw: 授權儲存體已建立。

# AuthorizationManager_Status_OpenSuccess
source: Authorization store opened.
zh_tw: 授權儲存體已開啟。

# AuthorizationManager_Status_CloseStore
source: Authorization store closed.
zh_tw: 授權儲存體已關閉。

# AuthorizationManager_Status_DeleteSuccess
source: Authorization store deleted.
zh_tw: 授權儲存體已刪除。

# AuthorizationManager_Status_RefreshComplete
source: Refresh complete.
zh_tw: 重新整理完成。

# AuthorizationStorePage_StoreNamePlaceholder
source: Store name
zh_tw: 儲存體名稱

# AuthorizationStorePage_StoreType_Default
source: Store type
zh_tw: 儲存體類型

# AuthorizationStorePage_Properties
source: Properties
zh_tw: 屬性

# AuthorizationStorePage_DeleteStore
source: Delete store
zh_tw: 刪除儲存體

# AuthorizationStorePage_ApplicationsHeader
source: Applications
zh_tw: 應用程式

# AuthorizationStorePage_GroupsHeader
source: Groups
zh_tw: 群組

# AuthorizationStorePage_DeleteApplicationTooltip
source: Delete application
zh_tw: 刪除應用程式

# AuthorizationStorePage_EditGroupTooltip
source: Edit group
zh_tw: 編輯群組

# AuthorizationStorePage_DeleteGroupTooltip
source: Delete group
zh_tw: 刪除群組

# AuthorizationStorePage_DeleteStore_Title
source: Delete store
zh_tw: 刪除儲存體

# AuthorizationStorePage_DeleteStore_Content
source: Are you sure you want to delete this store?
zh_tw: 確定要刪除此儲存體嗎？

# AuthorizationStorePage_DeleteApplication_Title
source: Delete application
zh_tw: 刪除應用程式

# AuthorizationStorePage_DeleteApplication_Content
source: Are you sure you want to delete this application?
zh_tw: 確定要刪除此應用程式嗎？

# AuthorizationStorePage_DeleteGroup_Title
source: Delete group
zh_tw: 刪除群組

# AuthorizationStorePage_DeleteGroup_Content
source: Are you sure you want to delete this group?
zh_tw: 確定要刪除此群組嗎？

# AuthorizationStorePage_Status_PropertiesUpdated
source: Store properties updated.
zh_tw: 儲存體屬性已更新。

# AuthorizationStorePage_Status_PropertiesUpdateFailed
source: Failed to update store properties.
zh_tw: 更新儲存體屬性失敗。

# AuthorizationStorePage_Status_AppCreated
source: Application created.
zh_tw: 應用程式已建立。

# AuthorizationStorePage_Status_AppDeleted
source: Application deleted.
zh_tw: 應用程式已刪除。

# AuthorizationStorePage_Status_GroupCreated
source: Group created.
zh_tw: 群組已建立。

# AuthorizationStorePage_Status_GroupUpdated
source: Group updated.
zh_tw: 群組已更新。

# AuthorizationStorePage_Status_GroupUpdateFailed
source: Failed to update group.
zh_tw: 更新群組失敗。

# AuthorizationStorePage_Status_GroupDeleted
source: Group deleted.
zh_tw: 群組已刪除。

# AuthorizationStore_Status_CreatingApplication
source: Creating application
zh_tw: 正在建立應用程式

# AuthorizationStore_Status_CreateApplicationSuccess
source: Application created.
zh_tw: 應用程式已建立。

# AuthorizationStore_Status_DeletingApplication
source: Deleting application
zh_tw: 正在刪除應用程式…

# AuthorizationStore_Status_DeleteApplicationSuccess
source: Application deleted.
zh_tw: 應用程式已刪除。

# AuthorizationStore_Status_CreatingGroup
source: Creating group
zh_tw: 正在建立群組…

# AuthorizationStore_Status_CreateGroupSuccess
source: Group created.
zh_tw: 群組已建立。

# AuthorizationStore_Status_DeletingGroup
source: Deleting group
zh_tw: 正在刪除群組…

# AuthorizationStore_Status_DeleteGroupSuccess
source: Group deleted.
zh_tw: 群組已刪除。

# AuthorizationStore_Status_UpdateGroupSuccess
source: Group updated.
zh_tw: 群組已更新。

# OpenStoreDialog_Title
source: Open Authorization Store
zh_tw: 開啟授權儲存體

# OpenStoreDialog_StoreType_Label
source: Store type
zh_tw: 儲存體類型

# OpenStoreDialog_StoreType_Xml
source: XML file
zh_tw: XML 檔案

# OpenStoreDialog_XmlPath_Label
source: File path
zh_tw: 檔案路徑

# OpenStoreDialog_AdPath_Label
source: Active Directory path
zh_tw: Active Directory 路徑

# OpenStoreDialog_Sql_Label
source: SQL Server connection
zh_tw: SQL Server 連線

# OpenStoreDialog_Sql_Server_Placeholder
source: Server name or IP address
zh_tw: 伺服器名稱或 IP 位址

# OpenStoreDialog_Sql_Database_Placeholder
source: Database name
zh_tw: 資料庫名稱

# OpenStoreDialog_Sql_Store_Placeholder
source: Policy store name
zh_tw: Policy 儲存體名稱

# OpenStoreDialog_OpenMode_Label
source: Open mode
zh_tw: 開啟模式

# OpenStoreDialog_OpenMode_Admin
source: Administrator (read/write)
zh_tw: 管理員（讀寫）

# OpenStoreDialog_OpenMode_Reader
source: Reader (read-only)
zh_tw: 唯讀（僅讀）

# OpenStoreDialog_FileDialog_Title
source: Select Authorization Store
zh_tw: 選取授權儲存體

# OpenStoreDialog_Error_InvalidPath
source: Please specify a valid store path.
zh_tw: 請指定有效的儲存體路徑。

# OpenStoreDialog_Error_FileNotFound
source: The file '{0}' was not found.
zh_tw: 找不到檔案 '{0}'.

# StorePropertiesDialog_Title
source: Store Properties
zh_tw: 儲存體屬性

# StorePropertiesDialog_Tab_General
source: General
zh_tw: 一般

# StorePropertiesDialog_StoreInfo_Header
source: Store Information
zh_tw: 儲存體資訊

# StorePropertiesDialog_StorePath_Header
source: Store path
zh_tw: 儲存體路徑

# StorePropertiesDialog_StoreType_Header
source: Store type
zh_tw: 儲存體類型

# StorePropertiesDialog_SchemaVersion_Header
source: Schema version
zh_tw: Schema 版本

# StorePropertiesDialog_Description_Header
source: Description
zh_tw: 描述

# StorePropertiesDialog_Description_Placeholder
source: Enter a description
zh_tw: 輸入描述

# StorePropertiesDialog_Settings_Header
source: Settings
zh_tw: 設定

# StorePropertiesDialog_GenerateAudits
source: Generate audits
zh_tw: 啟用稽核

# StorePropertiesDialog_ApplicationData_Header
source: Application data
zh_tw: 應用程式資料

# StorePropertiesDialog_ApplicationData_Placeholder
source: Enter application-specific data
zh_tw: 輸入應用程式專用資料

# StorePropertiesDialog_Tab_Security
source: Security
zh_tw: 安全性

# StorePropertiesDialog_PolicyAdmins_Header
source: Policy Administrators
zh_tw: 政策管理者

# StorePropertiesDialog_PolicyAdmins_Description
source: Users and groups with full control over the policy store.
zh_tw: 對政策儲存體擁有完全控制權的使用者與群組。

# StorePropertiesDialog_PolicyReaders_Header
source: Policy Readers
zh_tw: 政策讀者

# StorePropertiesDialog_PolicyReaders_Description
source: Users and groups with read-only access to the policy store.
zh_tw: 擁有政策儲存體唯讀存取權的使用者與群組。

# StorePropertiesDialog_Tab_Auditing
source: Auditing
zh_tw: 稽核

# StorePropertiesDialog_Auditing_Info_Title
source: Audit Configuration
zh_tw: 稽核設定

# StorePropertiesDialog_Auditing_Info_Message
source: Configure auditing settings for this authorization store.
zh_tw: 為此授權儲存體設定稽核選項。

# StorePropertiesDialog_Auditing_Description
source: Enable auditing to track authorization decisions and policy changes.
zh_tw: 啟用稽核以追蹤授權決定與政策變更。

# StorePropertiesDialog_StoreType_Xml
source: XML file
zh_tw: XML 檔案

# StorePropertiesDialog_StoreType_Unknown
source: Unknown
zh_tw: 未知

# StoreAdvancedPropertiesDialog_Title
source: Advanced Store Properties
zh_tw: 進階儲存體屬性

# StoreAdvancedPropertiesDialog_TitleWithName
source: Advanced Properties - {0}
zh_tw: 進階屬性 - {0}

# StoreAdvancedPropertiesDialog_TimeoutSettings_Header
source: Timeout Settings
zh_tw: 逾時設定

# StoreAdvancedPropertiesDialog_DomainTimeout_Header
source: Domain timeout (ms)
zh_tw: 網域逾時（毫秒）

# StoreAdvancedPropertiesDialog_DomainTimeout_Description
source: Maximum time to wait for domain controller responses.
zh_tw: 等待網域控制站回應的最長時間。

# StoreAdvancedPropertiesDialog_ScriptTimeout_Header
source: Script engine timeout (ms)
zh_tw: 腳本引擎逾時（毫秒）

# StoreAdvancedPropertiesDialog_ScriptTimeout_Description
source: Maximum time for business rule script execution.
zh_tw: 商業規則腳本執行的最長時間。

# StoreAdvancedPropertiesDialog_ScriptEngineSettings_Header
source: Script Engine Settings
zh_tw: 腳本引擎設定

# StoreAdvancedPropertiesDialog_MaxScriptEngines_Header
source: Maximum script engines
zh_tw: 最大腳本引擎數

# StoreAdvancedPropertiesDialog_MaxScriptEngines_Description
source: Maximum number of concurrent script engines.
zh_tw: 允許的最大並行腳本引擎數量。

# StoreAdvancedPropertiesDialog_AuditSettings_Header
source: Audit Settings
zh_tw: 稽核設定

# StoreAdvancedPropertiesDialog_GenerateAudits_Header
source: Generate audits
zh_tw: 啟用稽核

# StoreAdvancedPropertiesDialog_GenerateAudits_Description
source: Enable audit event generation for authorization decisions.
zh_tw: 為授權決定啟用稽核事件產生。

# StoreAdvancedPropertiesDialog_TargetMachine_Header
source: Target Machine
zh_tw: 目標主機

# StoreAdvancedPropertiesDialog_TargetMachine_NameHeader
source: Machine name
zh_tw: 主機名稱

# StoreAdvancedPropertiesDialog_TargetMachine_Placeholder
source: Local computer
zh_tw: 本機

# StoreAdvancedPropertiesDialog_TargetMachine_Local
source: Local computer
zh_tw: 本機

# StoreAdvancedPropertiesDialog_ResetButton
source: Reset to defaults
zh_tw: 重設為預設值

# StoreAdvancedPropertiesDialog_Error_LoadFailed
source: Failed to load advanced properties: {0}
zh_tw: 載入進階屬性失敗：{0}

# StoreAdvancedPropertiesDialog_Error_DomainTimeout
source: Domain timeout must be at least 1000 milliseconds.
zh_tw: 網域逾時必須至少為 1000 毫秒。

# StoreAdvancedPropertiesDialog_Error_ScriptTimeout
source: Script timeout must be at least 1000 milliseconds.
zh_tw: 腳本逾時必須至少為 1000 毫秒。

# StoreAdvancedPropertiesDialog_Error_MaxScriptEngines
source: Maximum script engines must be at least 1.
zh_tw: 最大腳本引擎數必須至少為 1。

# CreateItemDialog_Title_Default
source: Create New Item
zh_tw: 建立新項目

# CreateItemDialog_Name_Label
source: Name
zh_tw: 名稱

# CreateItemDialog_Name_Placeholder_Default
source: Enter item name
zh_tw: 輸入項目名稱

# CreateItemDialog_GroupType_Label
source: Group type
zh_tw: 群組類型

# CreateItemDialog_GroupType_Basic
source: Basic
zh_tw: 基本

# CreateItemDialog_GroupType_LdapQuery
source: LDAP Query
zh_tw: LDAP 查詢

# CreateItemDialog_LdapQuery_Label
source: LDAP query
zh_tw: LDAP 查詢

# CreateItemDialog_LdapQuery_Placeholder
source: Enter LDAP query string
zh_tw: 輸入 LDAP 查詢字串

# CreateItemDialog_OperationId_Label
source: Operation ID
zh_tw: 操作 ID

# CreateItemDialog_OperationId_Placeholder
source: -1 (auto-assign)
zh_tw: -1（自動指定）

# CreateItemDialog_Description_Label
source: Description
zh_tw: 描述

# CreateItemDialog_Description_Placeholder
source: Enter description
zh_tw: 輸入描述

# CreateItemDialog_Title_Application
source: Create New Application
zh_tw: 建立新應用程式

# CreateItemDialog_Name_Placeholder_Application
source: Enter application name
zh_tw: 輸入應用程式名稱

# CreateItemDialog_Title_Group
source: Create New Group
zh_tw: 建立新群組

# CreateItemDialog_Name_Placeholder_Group
source: Enter group name
zh_tw: 輸入群組名稱

# CreateItemDialog_Title_RoleDefinition
source: Create New Role Definition
zh_tw: 建立新角色定義

# CreateItemDialog_Name_Placeholder_RoleDefinition
source: Enter role definition name
zh_tw: 輸入角色定義名稱

# CreateItemDialog_Title_RoleAssignment
source: Create New Role Assignment
zh_tw: 建立新角色指派

# CreateItemDialog_Name_Placeholder_RoleAssignment
source: Enter role assignment name
zh_tw: 輸入角色指派名稱

# CreateItemDialog_Title_Task
source: Create New Task
zh_tw: 建立新工作

# CreateItemDialog_Name_Placeholder_Task
source: Enter task name
zh_tw: 輸入工作名稱

# CreateItemDialog_Title_Operation
source: Create New Operation
zh_tw: 建立新操作

# CreateItemDialog_Name_Placeholder_Operation
source: Enter operation name
zh_tw: 輸入操作名稱

# CreateItemDialog_Error_EnterName
source: Please enter a name.
zh_tw: 請輸入名稱。

# CreateItemDialog_Error_InvalidNameCharacters
source: Name cannot contain '/', '\', or ':' characters.
zh_tw: 名稱不可包含 '/'、'\\' 或 ':' 字元。

# CreateItemDialog_Error_LdapQueryRequired
source: LDAP query is required for LDAP Query groups.
zh_tw: LDAP 查詢群組需要 LDAP 查詢。

# EditItemDialog_Title_Default
source: Edit Item
zh_tw: 編輯項目

# EditItemDialog_General_Header
source: General
zh_tw: 一般

# EditItemDialog_Name_Header
source: Name
zh_tw: 名稱

# EditItemDialog_Name_Placeholder
source: Item name
zh_tw: 項目名稱

# EditItemDialog_Description_Header
source: Description
zh_tw: 描述

# EditItemDialog_Description_Placeholder
source: Enter description
zh_tw: 輸入描述

# EditItemDialog_GroupType_Header
source: Group Type
zh_tw: 群組類型

# EditItemDialog_GroupType_Label
source: Type
zh_tw: 類型

# EditItemDialog_GroupType_Basic
source: Basic
zh_tw: 基本

# EditItemDialog_GroupType_LdapQuery
source: LDAP Query
zh_tw: LDAP 查詢

# EditItemDialog_LdapQuery_Header
source: LDAP Query
zh_tw: LDAP 查詢

# EditItemDialog_LdapQuery_Label
source: Query string
zh_tw: 查詢字串

# EditItemDialog_LdapQuery_Placeholder
source: Enter LDAP query
zh_tw: 輸入 LDAP 查詢

# EditItemDialog_Operation_Header
source: Operation
zh_tw: 操作

# EditItemDialog_OperationId_Header
source: Operation ID
zh_tw: 操作 ID

# EditItemDialog_ApplicationData_Header
source: Application Data
zh_tw: 應用程式資料

# EditItemDialog_ApplicationData_Label
source: Data
zh_tw: 資料

# EditItemDialog_ApplicationData_Placeholder
source: Enter application-specific data
zh_tw: 輸入應用程式專用資料

# EditItemDialog_Title_Store
source: Edit Store
zh_tw: 編輯儲存體

# EditItemDialog_Title_Application
source: Edit Application
zh_tw: 編輯應用程式

# EditItemDialog_Title_Group
source: Edit Group
zh_tw: 編輯群組

# EditItemDialog_Title_RoleDefinition
source: Edit Role Definition
zh_tw: 編輯角色定義

# EditItemDialog_Title_RoleAssignment
source: Edit Role Assignment
zh_tw: 編輯角色指派

# EditItemDialog_Title_Task
source: Edit Task
zh_tw: 編輯工作

# EditItemDialog_Title_Operation
source: Edit Operation
zh_tw: 編輯操作

# EditItemDialog_Error_LdapQueryRequired
source: LDAP query is required for LDAP Query groups.
zh_tw: LDAP 查詢群組需要 LDAP 查詢。

# AssignItemsDialog_Title_Default
source: Assign Items
zh_tw: 指派項目

# AssignItemsDialog_SearchPlaceholder
source: Search items
zh_tw: 搜尋項目

# AssignItemsDialog_AvailableItems_Header
source: Available Items
zh_tw: 可用項目

# AssignItemsDialog_SelectedItems_Header
source: Selected Items
zh_tw: 已選取項目

# AssignItemsDialog_Title_OperationsToTask
source: Assign Operations to Task - {0}
zh_tw: 將操作指派給工作 - {0}

# AssignItemsDialog_Title_TasksToRole
source: Assign Tasks to Role - {0}
zh_tw: 將工作指派給角色 - {0}

# AssignItemsDialog_Title_OperationsToRole
source: Assign Operations to Role - {0}
zh_tw: 將操作指派給角色 - {0}

# AssignItemsDialog_Title_RolesToRole
source: Assign Roles to Role - {0}
zh_tw: 將角色指派給角色 - {0}

# GroupMembersDialog_Title
source: Group Members
zh_tw: 群組成員

# GroupMembersDialog_TitleWithName
source: Group Members - {0}
zh_tw: 群組成員 - {0}

# GroupMembersDialog_Tab_Members
source: Members
zh_tw: 成員

# GroupMembersDialog_Tab_NonMembers
source: Non-Members
zh_tw: 非成員

# GroupMembersDialog_Tab_AppGroups
source: Application Groups
zh_tw: 應用程式群組

# GroupMembersDialog_IncludedGroups_Header
source: Included Groups
zh_tw: 包含的群組

# GroupMembersDialog_ExcludedGroups_Header
source: Excluded Groups
zh_tw: 排除的群組

# PolicyUsersDialog_Title
source: Policy Users
zh_tw: 政策使用者

# PolicyUsersDialog_TitleWithName
source: Policy Users - {0}
zh_tw: 政策使用者 - {0}

# PolicyUsersDialog_Tab_Administrators
source: Administrators
zh_tw: 管理者

# PolicyUsersDialog_Tab_Readers
source: Readers
zh_tw: 讀者

# PolicyUsersDialog_Tab_Delegated
source: Delegated
zh_tw: 委派

# PolicyUsersDialog_EmptyState
source: No users or groups
zh_tw: 沒有使用者或群組

# PolicyUsersDialog_Message_LoadFailed
source: Failed to load policy users: {0}
zh_tw: 載入政策使用者失敗：{0}

# PolicyUsersDialog_Message_UserAdded
source: User '{0}' added successfully.
zh_tw: 使用者 '{0}' 新增成功。

# PolicyUsersDialog_Title_UserAdded
source: User Added
zh_tw: 使用者已新增

# PolicyUsersDialog_Message_AddUserFailed
source: Failed to add user: {0}
zh_tw: 新增使用者失敗：{0}

# PolicyUsersDialog_RemoveUser_Title
source: Remove User
zh_tw: 移除使用者

# PolicyUsersDialog_RemoveUser_Content
source: Are you sure you want to remove '{0}' from {1}?
zh_tw: 確定要從 {1} 移除 '{0}'？

# PolicyUsersDialog_Message_UserRemoved
source: User '{0}' removed successfully.
zh_tw: 使用者 '{0}' 已移除。

# PolicyUsersDialog_Title_UserRemoved
source: User Removed
zh_tw: 使用者已移除

# PolicyUsersDialog_Message_RemoveUserFailed
source: Failed to remove user: {0}
zh_tw: 移除使用者失敗：{0}

# PolicyUsersDialog_Type_Readers
source: Readers
zh_tw: 讀者

# PolicyUsersDialog_Type_Delegated
source: Delegated Users
zh_tw: 委派使用者

# PolicyUsersDialog_Type_Administrators
source: Administrators
zh_tw: 管理者

# RoleAssignmentTasksDialog_Title
source: Role Assignment Tasks
zh_tw: 角色指派工作

# RoleAssignmentTasksDialog_TitleWithName
source: Role Assignment Tasks - {0}
zh_tw: 角色指派工作 - {0}

# RoleAssignmentTasksDialog_TitleWithScope
source: Role Assignment Tasks - {0} (Scope: {1})
zh_tw: 角色指派工作 - {0}（範圍：{1}）

# RoleAssignmentTasksDialog_AssignedTasks_Header
source: Assigned Tasks
zh_tw: 已指派的工作

# RoleAssignmentTasksDialog_NoTasks
source: No tasks assigned
zh_tw: 未指派任何工作

# RoleAssignmentTasksDialog_AssignedOperations_Header
source: Assigned Operations
zh_tw: 已指派的操作

# RoleAssignmentTasksDialog_NoOperations
source: No operations assigned
zh_tw: 未指派任何操作

# RoleAssignmentTasksDialog_Message_NoTasksAvailable
source: No tasks available to assign.
zh_tw: 沒有可指派的工作。

# RoleAssignmentTasksDialog_Message_LoadTasksFailed
source: Failed to load tasks: {0}
zh_tw: 載入工作失敗：{0}

# RoleAssignmentTasksDialog_Message_TaskAdded
source: Task '{0}' added successfully.
zh_tw: 工作 '{0}' 新增成功。

# RoleAssignmentTasksDialog_Title_TaskAdded
source: Task Added
zh_tw: 工作已新增

# RoleAssignmentTasksDialog_Message_AddTaskFailed
source: Failed to add task: {0}
zh_tw: 新增工作失敗：{0}

# RoleAssignmentTasksDialog_Message_TaskRemoved
source: Task '{0}' removed successfully.
zh_tw: 工作 '{0}' 已移除。

# RoleAssignmentTasksDialog_Title_TaskRemoved
source: Task Removed
zh_tw: 工作已移除

# RoleAssignmentTasksDialog_Message_RemoveTaskFailed
source: Failed to remove task: {0}
zh_tw: 移除工作失敗：{0}

# RoleAssignmentTasksDialog_Message_NoOperationsAvailable
source: No operations available to assign.
zh_tw: 沒有可指派的操作。

# RoleAssignmentTasksDialog_Message_LoadOperationsFailed
source: Failed to load operations: {0}
zh_tw: 載入操作失敗：{0}

# RoleAssignmentTasksDialog_Message_OperationAdded
source: Operation '{0}' added successfully.
zh_tw: 操作 '{0}' 新增成功。

# RoleAssignmentTasksDialog_Title_OperationAdded
source: Operation Added
zh_tw: 操作已新增

# RoleAssignmentTasksDialog_Message_AddOperationFailed
source: Failed to add operation: {0}
zh_tw: 新增操作失敗：{0}

# RoleAssignmentTasksDialog_Message_OperationRemoved
source: Operation '{0}' removed successfully.
zh_tw: 操作 '{0}' 已移除。

# RoleAssignmentTasksDialog_Title_OperationRemoved
source: Operation Removed
zh_tw: 操作已移除

# RoleAssignmentTasksDialog_Message_RemoveOperationFailed
source: Failed to remove operation: {0}
zh_tw: 移除操作失敗：{0}

# SelectItemDialog_Title_AddTask
source: Add Task
zh_tw: 新增工作

# SelectItemDialog_Description_AddTask
source: Select a task to add to this role assignment.
zh_tw: 選擇要加入此角色指派的工作。

# SelectItemDialog_Title_AddOperation
source: Add Operation
zh_tw: 新增操作

# SelectItemDialog_Description_AddOperation
source: Select an operation to add to this role assignment.
zh_tw: 選擇要加入此角色指派的操作。

# BizRuleEditorDialog_Title
source: Business Rule Editor
zh_tw: 商業規則編輯器

# BizRuleEditorDialog_ValidateButton
source: Validate
zh_tw: 驗證

# BizRuleEditorDialog_Language_Label
source: Script language
zh_tw: 腳本語言

# BizRuleEditorDialog_InsertSample
source: Insert Sample
zh_tw: 插入範例

# BizRuleEditorDialog_InsertSample_Tooltip
source: Insert sample business rule script
zh_tw: 插入商業規則範例腳本

# BizRuleEditorDialog_Clear_Tooltip
source: Clear script
zh_tw: 清除腳本

# BizRuleEditorDialog_ImportButton
source: Import
zh_tw: 匯入

# BizRuleEditorDialog_Import_Tooltip
source: Import script from file
zh_tw: 從檔案匯入腳本

# BizRuleEditorDialog_ExportButton
source: Export
zh_tw: 匯出

# BizRuleEditorDialog_Export_Tooltip
source: Export script to file
zh_tw: 將腳本匯出到檔案

# BizRuleEditorDialog_Script_Placeholder
source: Enter business rule script here
zh_tw: 在此輸入商業規則腳本…

# BizRuleEditorDialog_ImportedFrom_Prefix
source: Imported from:
zh_tw: 匯入自：

# BizRuleEditorDialog_Validation_Header
source: Validation Results
zh_tw: 驗證結果

# BizRuleEditorDialog_Validation_SuccessInline
source: Script is valid
zh_tw: 腳本有效

# BizRuleEditorDialog_TitleWithName
source: Business Rule Editor - {0}
zh_tw: 商業規則編輯器 - {0}

# BizRuleEditorDialog_ImportedFrom_Format
source: Imported from: {0}
zh_tw: 匯入自：{0}

# BizRuleEditorDialog_SampleComment_Format
source: Sample business rule for {0}
zh_tw: 針對 {0} 的商業規則範例

# BizRuleEditorDialog_Message_SampleInserted
source: Sample script inserted.
zh_tw: 範例腳本已插入。

# BizRuleEditorDialog_Title_SampleInserted
source: Sample Inserted
zh_tw: 已插入範例
